# Checking Your Jupyter Notebook Environment

In [2]:
import warnings
#warnings.filterwarnings('ignore')

In [3]:
import sys
import os
import platform 
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
# run the following if it is the first time
try:
    import plotly
except:
    os.system("pip install plotly")

In [5]:
# run the following if it is the first time
try:
    import dash
except:
    os.system("pip install dash --user")

In [6]:
try:
    import yfinance
except:
    os.system("pip install yfinance")

In [7]:
try:
    import yahoofinancials
except:
    os.system("pip install yahoofinancials")

In [8]:
import plotly
import dash
import yfinance
import yahoofinancials

In [9]:
print(sys.executable)
print(platform.python_version())
print(pd.__version__)
print(np.__version__)
print(plotly.__version__)
print(dash.__version__)
print(yfinance.__version__)

c:\Users\tomso\anaconda3\python.exe
3.11.4
1.5.3
1.24.3
5.9.0
2.13.0
0.2.28

# check datasets available

In [10]:
# Common datasets from seaborn
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

**Iris Dataset is the "Hello World" dataset in Machine Learning**

In [11]:
iris = sns.load_dataset('iris')
iris.head()

   sepal_length  sepal_width  petal_length  petal_width species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [12]:
iris.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [13]:
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Testing yfinance

In [14]:
import yfinance as yf
import option
import utils

ModuleNotFoundError: No module named 'option'

In [ ]:
ticker = 'MSFT'
stock = yf.Ticker(ticker)

In [ ]:
df = stock.history(start = '2003-01-01', end = '2023-08-01', interval = '1d')
df

***Let's focus on the last 2 years data***

In [ ]:
df = df[-252*2:]
df

***Let's do some data visualization***

In [ ]:
import plotly.graph_objects as go

In [ ]:
fig = go.Figure(data=go.Scatter(x=df.index,y=df['Close'], mode='lines'))
fig.show()

***Add Volume to the chart***

In [ ]:
from plotly.subplots import make_subplots

In [ ]:
fig2 = make_subplots(specs=[[{"secondary_y": True}]])
fig2.add_trace(go.Scatter(x=df.index,y=df['Close'],name='Price'),secondary_y=False)
fig2.add_trace(go.Bar(x=df.index,y=df['Volume'],name='Volume'),secondary_y=True)
fig2.show()

### Make sure we can import our course library

In [ ]:
import option

In [ ]:
import utils

In [ ]:
opt = option.Option()

In [ ]:
print(opt.verbose, opt.start_date, opt.end_date, opt.tickers)

In [ ]:
ticker = 'MSFT'
yfinancials = utils.MyYahooFinancials(ticker)
print(f"Getting Financial Data for {ticker}")
print(f"{ticker} Long Term Debt is {yfinancials.get_long_term_debt()}")